import json


dct = {
    'биология': '11',
    'информатика': '7',
    "математика": "6",
    "русский язык": "1",
    "химия": "13",
    "история": "8",
    "физика": "12",
    "астрономия": "20",
    "география": "10",
    "изо": "22",
    "искусство": "18",
    "лингвистика": "24",
    "литература": "2",
    "обж": "16",
    "обществознание": "9",
    "предпринимательство": "23",
    "право": "15",
    "психология": "28",
    "робототехника": "27",
    "технология": "17",
    "физкультура": "19",
    "черчение": "31",
    "экология": "21",
    "экономика": "14",
    "ин. языки": "3"
}
with open('subject_to_code.json', 'w', encoding='utf-8') as json_file:
    json.dump(dct, json_file, ensure_ascii=False, indent=4)